### groupby
- df.groupby(```묶음의 기준이 되는 컬럼```)[ ```적용받는 컬럼``` ].```적용받는 연산```()
- df.groupby("Team")['Points'].sum()

In [19]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(ipl_data)
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [20]:
df.groupby("Team")['Points'].mean()

Team
Devils    768.000000
Kings     761.666667
Riders    762.250000
Royals    752.500000
kings     812.000000
Name: Points, dtype: float64

##### Hierarchical index
- 두 개의 column으로 groupby할 경우 index가 두 개 생성

In [21]:
a = df.groupby(["Team","Year"])['Points'].mean()

In [25]:
a.index

MultiIndex(levels=[['Devils', 'Kings', 'Riders', 'Royals', 'kings'], [2014, 2015, 2016, 2017]],
           labels=[[0, 0, 1, 1, 1, 2, 2, 2, 2, 3, 3, 4], [0, 1, 0, 2, 3, 0, 1, 2, 3, 0, 1, 1]],
           names=['Team', 'Year'])

In [26]:
a

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
kings   2015    812
Name: Points, dtype: int64

##### Hierarchical index - unstack()
- group으로 묶인 데이터를 matrix형태로 전환시켜준다.

In [35]:
a.unstack()

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0    NaN  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN
kings     NaN  812.0    NaN    NaN

In [37]:
a.unstack(fill_value=0)

Year    2014  2015  2016  2017
Team
Devils   863   673     0     0
Kings    741     0   756   788
Riders   876   789   694   690
Royals   701   804     0     0
kings      0   812     0     0

##### Hierarchical index - swaplevel()
- index level을 변경할 수 있다.

In [28]:
a.swaplevel().head()

Year  Team
2014  Devils    863
2015  Devils    673
2014  Kings     741
2016  Kings     756
2017  Kings     788
Name: Points, dtype: int64

In [29]:
a.swaplevel().sortlevel(0).head()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level=...)
  """Entry point for launching an IPython kernel.

Year  Team
2014  Devils    863
      Kings     741
      Riders    876
      Royals    701
2015  Devils    673
Name: Points, dtype: int64

연도기준으로 오름차순으로 정렬

##### Hierarchical index - operations
- index level기준으로 기본연산 수행가능

In [30]:
a.head()

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Name: Points, dtype: int64

In [33]:
# 앞에 있는 Team index를 기준으로 합침
a.sum(level=0)

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [34]:
# 뒤에 있는 Year index를 기준으로 합침
a.sum(level=1)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

### Split -> Apply -> Combine

##### Split - grouped
- groupby에 의해 split된 상태를 추출가능함

In [38]:
grouped = df.groupby("Team")

In [40]:
for name, group in grouped:
    print(name)
    print(group)

Devils
   Points  Rank    Team  Year
2     863     2  Devils  2014
3     673     3  Devils  2015
Kings
   Points  Rank   Team  Year
4     741     3  Kings  2014
6     756     1  Kings  2016
7     788     1  Kings  2017
Riders
    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017
Royals
    Points  Rank    Team  Year
9      701     4  Royals  2014
10     804     1  Royals  2015
kings
   Points  Rank   Team  Year
5     812     4  kings  2015

In [41]:
for data in grouped:
    print(data)

('Devils',    Points  Rank    Team  Year
2     863     2  Devils  2014
3     673     3  Devils  2015)
('Kings',    Points  Rank   Team  Year
4     741     3  Kings  2014
6     756     1  Kings  2016
7     788     1  Kings  2017)
('Riders',     Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017)
('Royals',     Points  Rank    Team  Year
9      701     4  Royals  2014
10     804     1  Royals  2015)
('kings',    Points  Rank   Team  Year
5     812     4  kings  2015)

In [42]:
# 하나씩 뽑을 수 있음
grouped.get_group("Devils")

   Points  Rank    Team  Year
2     863     2  Devils  2014
3     673     3  Devils  2015

#### Apply - aggregation

In [43]:
grouped.agg(sum)

        Points  Rank  Year
Team
Devils    1536     5  4029
Kings     2285     5  6047
Riders    3049     7  8062
Royals    1505     5  4029
kings      812     4  2015

In [45]:
grouped.agg(np.mean)

            Points      Rank         Year
Team
Devils  768.000000  2.500000  2014.500000
Kings   761.666667  1.666667  2015.666667
Riders  762.250000  1.750000  2015.500000
Royals  752.500000  2.500000  2014.500000
kings   812.000000  4.000000  2015.000000

In [47]:
# 특정 컬럼에 여러개의 function을 apply할 수도 있음
grouped['Points'].agg([np.sum,np.mean, np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

#### Apply - Transformation
- 개별 데이터의 변환을 지원함.

In [51]:
score = lambda x : (x - x.mean()) / x.std()
grouped.transform(score)

      Points      Rank      Year
0   1.284327 -1.500000 -1.161895
1   0.302029  0.500000 -0.387298
2   0.707107 -0.707107 -0.707107
3  -0.707107  0.707107  0.707107
4  -0.860862  1.154701 -1.091089
5        NaN       NaN       NaN
6  -0.236043 -0.577350  0.218218
7   1.096905 -0.577350  0.872872
8  -0.770596  0.500000  0.387298
9  -0.707107  0.707107 -0.707107
10  0.707107 -0.707107  0.707107
11 -0.815759  0.500000  1.161895

각 데이터에 적용. 헷갈리는 개념이라 원래 df와 비교하면서 볼 것.

#### Apply - Filter
- 특정 조건으로 데이터를 검색할 때 사용

In [52]:
df.groupby("Team").filter(lambda x : len(x) >= 3)

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
4      741     3   Kings  2014
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
11     690     2  Riders  2017

In [56]:
df.groupby("Team").filter(lambda x: x['Points'].sum() > 1000)

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

sum()을 지우면 error가 뜨네...음...